<template>
	<view class="mt10">
		<view class="fz22 tac">城市运营商协议</view>
		<view class="fz14 mt10 ml10 mr10" style="text-indent:25px;color:#000000">
			<view style="font-weight:600" class="fz14">
				根据《中华人民共和国合同法》以及其它相关法律法规的规定，本着平等互利的原则，甲、乙双方就合作开展《刷脸软件》(以下简称为“产品”)以及刷脸收银设备(以下简称为“设备”)的推广应用，特订立本合同，并共同遵守下列条款：
			</view>
			<view class="fz16 mt10 mb10" style="font-weight:600"> 一．名称定义</view>
			<view class="" style="line-height:40upx;">
				除非本合同的条款或者内容中另有规定，下列名词具有如下意义：
				<br/>
				1、软件产品：指已进行商品化工作的、公开发表过的、且甲方作为权利人能够进行授权销售并能够提供技术支持和服务的软件。
				<br/>
				2、授权销售：指乙方被许可行使展示、销售软件产品的权利。
				<br/>
				3、知识产权：指依据中国有关法律和国际条约规定权利人所享有的专利权、版权(著作权)、商标权、技术秘密、商业信誉和商业秘密权。
				<br/>
				4、技术支持：应软件用户的要求，为用户解决软件应用过程中产生的各种技术问题；应乙方要求，为乙方培训销售、技术人员，使上述人员掌握技术支持、销售等服务中所需要的技术知识。
				<br/>
				5、售后服务：指为乙方及乙方用户提供产品或设备修理、退货、换货服务和软件维护、升级等服务。
				<br/>
				6、补充合同及附件：指主合同的补充条款或附件等，与主合同具有同样效力。
			</view>
			<view class="fz16 mt10 mb10" style="font-weight:600"> 二、合作内容</view>
			<view class="" style="line-height:40upx;">
				本合同有效期间，甲方作为权利人合法授权乙方销售的产品和设备信息如下：
				<br/>
				1、授权销售产品和设备：营销拓客系统、智慧点餐系统、收银系统、DSP广告一站式投放、超级短信以及刷脸收银设备。
				<br/>
				2、授权合伙人级别：城市运营商
			</view>
			<view class="fz16 mt10 mb10" style="font-weight:600">三、合作价格</view>
			<view class="clearfix" style="line-height:40upx;">
				本次乙方采购明细如下：
				<br/>
				<view class="mt10" style="text-indent:0px">
					<view class="box">
						<t-table @change="change">
							<t-tr>
								<t-th class="fz16">注册时间</t-th>
								<t-th class="fz16">代理级别</t-th>
								<t-th class="fz16">账号</t-th>
								<t-th class="fz16">团队数</t-th>
							</t-tr>
							<t-tr>
								<t-td style="font-size:14px;">九九智付收银系统及收银设备</t-td>
								<t-td style="font-size:14px;">16800元</t-td>
								<t-td style="font-size:14px;">APP支付 </t-td>
								<t-td style="font-size:14px;">城市运营商</t-td>
							</t-tr>
						</t-table>
					</view>
				</view>
				<view class="fz16 mt10 " style="margin-left: 190upx;">
					合计：人民币壹万贰陆仟捌佰元整
				</view>
				<br/>
				乙方应在合同签订之日起三日内，用转账或者现金方式，向甲方支付合同款项。如没有在规定时间内付款，则本合同自动终止，且先期支付款项不予退还。
			</view>
			<view class="fz16 mt10 mb10" style="font-weight:600"> 四、商户拓展考核</view>
			<view class="" style="line-height:40upx;">
				双方签订本协议后，第一年度无考核要求，第二年度起，乙方每个年度最低完成10家商户拓展(即乙方所代理的各套系统的铺设)或10台电子立牌(即收银设备)的安装激活指标，如第二年度无法完成指标的，甲方有权无条件取消乙方的代理资格，乙方原铺
				设的商家收益仍可享受费率分润。
			</view>
			
			<view class="fz16 mt10 mb10" style="font-weight:600">五、分润政策：</view>
			<view class="" style="line-height:40upx;">
				除非本合同的条款或者内容中另有规定，下列名词具有如下意义：
				<br/>
				1、乙方所铺设的设备代理费率为万分之16，结算周期为月结，结算日期为次月10日，如遇节假日顺延至第一个工作日。如微信、支付宝费率政策变更，甲方有权根据政策对代理费率作出相应调整。(结算日可根据微信，支付宝及甲方工作安排做调整，以甲方公告为准。)
				<br/>
				2、乙方拟获得其所铺设设备所产生的广告利润的百分之20，以甲方广告分润政策为准。
				<br/>
				3、乙方获得奖励佣金提现到账时间为T+1。
				<br/>
				4、乙方所铺设的设备激活补贴政策以微信、支付宝政策为准。乙方激活设备后需按照微信、支付宝及甲方设定的补贴要求，完成交易任务，方能产生相应补贴。
				<br/>
				5、乙方支付协议项下设备款后，如遇微信或支付宝官方调价，设备差价不予退还。
			</view>
			<view class="fz16 mt10 mb10" style="font-weight:600">六、权利和责任:</view>
			<view class="fz14 mb5" >（一）甲方的权利和责任</view>
			<view class="" style="line-height:40upx;">
				1、甲方向乙方按照本合同的约定提供产品和设备。<br/>
				2、甲方在乙方销售其代理的产品和设备销售过程中提供必要的支持。<br/>
				3、甲方有权在合同期内对产品和设备策略、市场策略和价格策略进行调整。<br/>
				4、甲方有权要求乙方共同维护市场秩序，维护零价格体系。<br/>
				5、甲方需保障系统的稳定性，且甲方承诺，系统为甲方独立开发并拥有完全的知识产权，由此产生的任何产权纠纷与乙方及签约客户无关。
			</view>
			<view class="fz14 mb5" >(二)乙方的权利和责任</view>
			<view class="" style="line-height:40upx;">
				1、乙方在合同签订时应向甲方提供工商部门年检过的乙方营业执照或个人身份信息。如有变更，请及时提交书面变更说明及变更后的相关证照。
				<br/>
				2、乙方在取得甲方的产品和设备销售授权后，即可在指定授权时间，在全国范围内铺设合同项下约定的照脸设备。乙方有权在广告和信函上表明其为甲方的授权服务商。
				<br/>
				3、乙方所代理的收银设备需另外购买，乙方根据微信、支付宝及甲方要求提供购买设备资料，向甲方申请购买设备，铺设协议项下设备。
				<br/>
				4、乙方承认甲方产品和设备的著作权、版权和其它知识产权等始终为甲方所有。乙方不得独自或与任何第三方对甲方产品和设备进行翻制、复制、解密、反编译、反汇编和其他反向工程，否则乙方应赔偿甲方因此而遭受的经济损失和甲方因维权而支付的合理费用(包括但不限于调查取证费、差旅食宿费、诉讼费、律师代理费等)。
				<br/>
				5、乙方可以免费得到甲方的电子版宣传资料、销售及技术服务资料。乙方所有销售的甲方产品和设备均须从甲方合法获得，不得从非法渠道获取。乙方在销售及推广甲方产品和设备过程中，应维护甲方的利益和形象。乙方负责产品和设备的销售推广、软件安装和调试工作，及时处理客户提出的产品和设备使用问题和意见。
				<br/>
				6、乙方在授权销售区域的产品和设备售后服务由乙方负责，其中属于技术方面原因的应及时与甲方联系，由甲方提供技术支持和咨询。
				<br/>
				7、乙方应诚信守法经营，除甲方提供的产品及服务外，对自己的经营活动独立承担法律责任。乙方需与签约的直接客户约定，将产品和设备用于合法经营，不违反任何法律法规，如乙方利用甲方提供的产品和服务从事任何违法违规的活动或经营，造成的任何纠纷与甲方没有任何关系。
				<br/>
				8、乙方有义务监督所推介客户合法经营，不得利用产品和设备进行信用卡套现、虚假交易、以及第三方支付公司(腾讯公司，支付宝公司)、中国人民银行规定的其他违规交易，如因乙方客户引起的非法违规操作令甲方与相关合作机构被处罚、终止或行政处分处罚等，甲方有权利终止本合同合作，对于乙方已产生的分润结算费用不予支付，以及产生的其他可能赔偿责任由乙方承担。
				<br/>
				9、如乙方明知或应当知道客户不符甲方规定的准入资格，或从事法律法规所限制(且无经营许可证)、禁止的业务或者业务变动、风险事件，却有意隐瞒或不告知相关信息的，乙方对甲方因此受到的损失承担连带赔偿责任。
				<br/>
				10、乙方获得的分润、提现等收益所产生的税费，由乙方自行缴纳承担。
			</view>
			
			<view class="fz16 mt10 mb10" style="font-weight:600">七、保密原则</view>
			<view class="" style="line-height:40upx;">
			甲乙双方应对履行合同过程中所涉及的商家用户信息及未经甲方允许公开的数据等信息严格保密，除法律另有规定外，不得披露给任何第三方。违反保密原则的一方应向相对方赔偿因违反保密协议而造成的经济损失和因维权而支付的合理费用。
			</view>
			<view class="fz16 mt10 mb10" style="font-weight:600">八、不可抗力事件</view>
			<view class="" style="line-height:40upx;">
			“不可抗力事件”是指超过一方能合理控制的范围并在受影响方加以合理的注意之下仍不能避免的任何事件，包括但不限于微信及支付宝政策更改、政府行为、通讯部门管控、通信运营商管控、地震、火灾、战争、黑客攻击、网络故障、网络拥堵、网络通信问题、微信平台调整相关规则或条件、支付宝调整相关规则或条件等。若甲方因受到“不可抗力事件”的影响而延迟履行或不能履行本合同义务的或造成会员数据丢失的，因此给乙方及其客户造成的损害、损失或费用支出，甲方不承担责任，且该种延迟履行或不履行不构成本合同违约。
			</view>
			<view class="fz16 mt10 mb10" style="font-weight:600">九、合同的期限、解除与终止</view>
			<view class="" style="line-height:40upx;">
			双方协商一致可以解除本合同。另外，本合同在下列情形下也可以解除，但提出解除的一方应提前个月以书面形式通知对方：
			<br/>
			1、本合同有效期自双方盖章起生效，有效期五年，如甲乙方在合同到期前30日内均没有提出书面终止合同，则本合同自动顺延壹年。如果乙方违反协议中的相关内容且违规操作市场，且在违约行为发生后的15日内未纠正违约行为，对方有权书面通知违约方后终止本协议。
			<br/>
			2、因合同一方经营状况出现重大困难，濒临破产进入法定整顿期间或被清算，另一方可以解除本合同。
			<br/>
			3、因合同一方未履行合同义务或违约，另一方经书面告知给予一定期限仍不履行或不予采取补救措施，致使另一方合同预期利益无法实现或无继续履行必要，另一方有权解除本合同。
			<br/>
			4、合同解除或合同到期自然终止，双方仍应履行未完毕之合同义务，并安排售出产品和设备的售后服务事项。
			<br/>
			5、合同解除或终止后，乙方须将合作期间发展的客户移交给甲方继续完成服务和售后，后续客户的交易费率分润乙方仍可享受，但客户所缴纳的软件服务等费用，乙方不再获得分成
			</view>
			<view class="fz16 mt10 mb10" style="font-weight:600">十、违约责任</view>
			<view class="" style="line-height:40upx;">
			1、甲方应积极营造良好的市场氛围和维护系统稳定，协助乙方积极开拓市场，不得做出有损于乙方利益的市场行为。若违反约定，给乙方造成损失的，甲方应承担赔偿责任。在甲方没有违约的情况下，合作费用不予退还。
			<br/>
			2、乙方应维护甲方的产品和设备形象和利益，不得做出有损于甲方利益的行为，若违反约定，给甲方造成损失的，乙方应承担赔偿责任。
			<br/>
			3、乙方若违反合同约定，侵犯甲方的知识产权，需赔偿甲方经济损失。
			<br/>
			4、若乙方违约给甲方造成损失的，除赔偿损失外，另需承担其它违约责任。
			<br/>
			5、在协议期间內及协议期满之日起一年内，乙方不得脱离甲方自行运营协议项下刷脸支付项目，也不得与其它第三方建立代理关系，成为协议项下刷脸支付项目第三方的代理商或服务商
			</view>
			<view class="fz16 mt10 mb10" style="font-weight:600">十一、争议解决</view>
			<view class="" style="line-height:40upx;">
			甲乙双方之间因履行本合同或因本合同任何条款的解释与适用而发生任何争议，甲、乙双方应通过友好协商解决。如协商不能解决，任何一方有权向甲方所在地法院提起诉讼。
			</view>
			<view class="fz16 mt10 mb10" style="font-weight:600">十二、其它</view>
			<view class="" style="line-height:40upx;margin-bottom: 20px;">
			凡涉及本合同补充、变更、解除等事宜，双方均可进行协商并签署补充合同作为合同附件。合同附件与本同具有同等法律效力。
			</view>
		</view>
	</view>
</template>

<script>
	import tTable from '@/components/t-table/t-table.vue';
	import tTh from '@/components/t-table/t-th.vue';
	import tTr from '@/components/t-table/t-tr.vue';
	import tTd from '@/components/t-table/t-td.vue';
	export default {
	    components: {
	        tTable,
	        tTh,
	        tTr,
	        tTd
			},
	}
</script>


<style  lang="scss">

</style>
